backend: tensorflow
class_name: Model
config:
  input_layers:
  - [img, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 512, 512, 1]
      dtype: float32
      name: img
      sparse: false
    inbound_nodes: []
    name: img
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id002 !!python/tuple [3, 3]
      name: conv2d_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - img
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: conv2d_2
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: conv2d_3
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_1
      padding: valid
      pool_size: &id003 !!python/tuple [2, 2]
      strides: *id003
      trainable: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id004 !!python/tuple [3, 3]
      name: conv2d_4
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: conv2d_5
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: conv2d_6
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout_2, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_2
      padding: valid
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [3, 3]
      name: conv2d_7
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv2d_8
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: conv2d_9
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: leaky_re_lu_3
  - class_name: Dropout
    config: {dtype: float32, name: dropout_3, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_3
      padding: valid
      pool_size: &id007 !!python/tuple [2, 2]
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id008 !!python/tuple [3, 3]
      name: conv2d_10
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: conv2d_11
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: conv2d_12
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_4, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: leaky_re_lu_4
  - class_name: Dropout
    config: {dtype: float32, name: dropout_4, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_4
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_4
      padding: valid
      pool_size: &id009 !!python/tuple [2, 2]
      strides: *id009
      trainable: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id010 !!python/tuple [1, 1]
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [3, 3]
      name: conv2d_transpose_1
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: conv2d_transpose_1
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: conv2d_transpose_2
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_1
        - 0
        - 0
        - {}
    name: conv2d_transpose_2
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: conv2d_transpose_3
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_2
        - 0
        - 0
        - {}
    name: conv2d_transpose_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_3
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: leaky_re_lu_5
  - class_name: Dropout
    config: {dtype: float32, name: dropout_5, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_5
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: up_sampling2d_1
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: up_sampling2d_1
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - up_sampling2d_1
        - 0
        - 0
        - &id012 {}
      - - dropout_4
        - 0
        - 0
        - *id012
    name: concatenate_1
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id013 !!python/tuple [3, 3]
      name: conv2d_transpose_4
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_transpose_4
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id013
      name: conv2d_transpose_5
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_4
        - 0
        - 0
        - {}
    name: conv2d_transpose_5
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id013
      name: conv2d_transpose_6
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_5
        - 0
        - 0
        - {}
    name: conv2d_transpose_6
  - class_name: Flatten
    config: {data_format: channels_last, dtype: float32, name: flatten_1, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: flatten_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - flatten_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_6, trainable: true}
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: leaky_re_lu_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Dropout
    config: {dtype: float32, name: dropout_6, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_6
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: leaky_re_lu_9
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: up_sampling2d_2
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: up_sampling2d_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout_9, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_9
        - 0
        - 0
        - {}
    name: dropout_9
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - up_sampling2d_2
        - 0
        - 0
        - &id014 {}
      - - dropout_3
        - 0
        - 0
        - *id014
    name: concatenate_2
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_9
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id015 !!python/tuple [3, 3]
      name: conv2d_transpose_7
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: conv2d_transpose_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id015
      name: conv2d_transpose_8
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_7
        - 0
        - 0
        - {}
    name: conv2d_transpose_8
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_10, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: leaky_re_lu_10
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id015
      name: conv2d_transpose_9
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_8
        - 0
        - 0
        - {}
    name: conv2d_transpose_9
  - class_name: Dropout
    config: {dtype: float32, name: dropout_10, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_10
        - 0
        - 0
        - {}
    name: dropout_10
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_9
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dropout_10
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: leaky_re_lu_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: Dropout
    config: {dtype: float32, name: dropout_7, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_7
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_11, trainable: true}
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: leaky_re_lu_11
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: up_sampling2d_3
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: up_sampling2d_3
  - class_name: Dropout
    config: {dtype: float32, name: dropout_11, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_11
        - 0
        - 0
        - {}
    name: dropout_11
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - up_sampling2d_3
        - 0
        - 0
        - &id016 {}
      - - dropout_2
        - 0
        - 0
        - *id016
    name: concatenate_3
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dropout_11
        - 0
        - 0
        - {}
    name: dense_4
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id017 !!python/tuple [3, 3]
      name: conv2d_transpose_10
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: conv2d_transpose_10
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_4
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id017
      name: conv2d_transpose_11
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_10
        - 0
        - 0
        - {}
    name: conv2d_transpose_11
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_12, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: leaky_re_lu_12
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id010
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id017
      name: conv2d_transpose_12
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_transpose_11
        - 0
        - 0
        - {}
    name: conv2d_transpose_12
  - class_name: Dropout
    config: {dtype: float32, name: dropout_12, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_12
        - 0
        - 0
        - {}
    name: dropout_12
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_12
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_5
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - dropout_12
        - 0
        - 0
        - {}
    name: dense_5
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_8, trainable: true}
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: leaky_re_lu_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - dense_5
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: Dropout
    config: {dtype: float32, name: dropout_8, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_8
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: LeakyReLU
    config: {alpha: 0.009999999776482582, dtype: float32, name: leaky_re_lu_13, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: leaky_re_lu_13
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      dtype: float32
      interpolation: nearest
      name: up_sampling2d_4
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: up_sampling2d_4
  - class_name: Dropout
    config: {dtype: float32, name: dropout_13, noise_shape: null, rate: 0.2, seed: null,
      trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_13
        - 0
        - 0
        - {}
    name: dropout_13
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - up_sampling2d_4
        - 0
        - 0
        - &id018 {}
      - - dropout_1
        - 0
        - 0
        - *id018
    name: concatenate_4
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_6
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dropout_13
        - 0
        - 0
        - {}
    name: dense_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_13
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: Activation
    config: {activation: sigmoid, dtype: float32, name: tube_present, trainable: true}
    inbound_nodes:
    - - - dense_6
        - 0
        - 0
        - {}
    name: tube_present
  - class_name: Activation
    config: {activation: sigmoid, dtype: float32, name: line_mask, trainable: true}
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: line_mask
  name: cad
  output_layers:
  - [tube_present, 0, 0]
  - [line_mask, 0, 0]
keras_version: 2.3.1
