backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 256, 256, 1]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_1, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Dropout
    config: {name: dropout_1, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_2
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_2, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_2
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Dropout
    config: {name: dropout_2, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_3, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: leaky_re_lu_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_4
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_3
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_4, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: leaky_re_lu_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_5
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_4
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_5, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: leaky_re_lu_5
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_3
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_5
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Dropout
    config: {name: dropout_3, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_6
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_6, trainable: true}
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: leaky_re_lu_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_7
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_6
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_7, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: leaky_re_lu_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_8
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_7
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_8, trainable: true}
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: leaky_re_lu_8
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_4
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_8
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: Dropout
    config: {name: dropout_4, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_9
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_9, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: leaky_re_lu_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_10
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_9
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_10, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: leaky_re_lu_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_11
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_10
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_11, trainable: true}
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: leaky_re_lu_11
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_11
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: Dropout
    config: {name: dropout_5, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_12
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_12, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: leaky_re_lu_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_13
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_12
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_13, trainable: true}
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: leaky_re_lu_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_14
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_13
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_14
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_14, trainable: true}
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: leaky_re_lu_14
  - class_name: Dropout
    config: {name: dropout_6, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - leaky_re_lu_14
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_15
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_15
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_15, trainable: true}
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: leaky_re_lu_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_16
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_15
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_16
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: batch_normalization_16
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_16, trainable: true}
    inbound_nodes:
    - - - batch_normalization_16
        - 0
        - 0
        - {}
    name: leaky_re_lu_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 5
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_17
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_16
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: Activation
    config: {activation: sigmoid, name: VECTOR, trainable: true}
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - {}
    name: VECTOR
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - &id002 {}
      - - VECTOR
        - 0
        - 0
        - *id002
    name: concatenate_1
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id003 !!python/tuple [1, 1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_1
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_transpose_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_17
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_1
        - 0
        - 0
        - {}
    name: batch_normalization_17
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_17, trainable: true}
    inbound_nodes:
    - - - batch_normalization_17
        - 0
        - 0
        - {}
    name: leaky_re_lu_17
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_transpose_2
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_17
        - 0
        - 0
        - {}
    name: conv2d_transpose_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_18
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_2
        - 0
        - 0
        - {}
    name: batch_normalization_18
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_18, trainable: true}
    inbound_nodes:
    - - - batch_normalization_18
        - 0
        - 0
        - {}
    name: leaky_re_lu_18
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_3
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_18
        - 0
        - 0
        - {}
    name: conv2d_transpose_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_19
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_3
        - 0
        - 0
        - {}
    name: batch_normalization_19
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_19, trainable: true}
    inbound_nodes:
    - - - batch_normalization_19
        - 0
        - 0
        - {}
    name: leaky_re_lu_19
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up_sampling2d_1
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_19
        - 0
        - 0
        - {}
    name: up_sampling2d_1
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_4
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - up_sampling2d_1
        - 0
        - 0
        - {}
    name: conv2d_transpose_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_20
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_4
        - 0
        - 0
        - {}
    name: batch_normalization_20
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_20, trainable: true}
    inbound_nodes:
    - - - batch_normalization_20
        - 0
        - 0
        - {}
    name: leaky_re_lu_20
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_transpose_5
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_20
        - 0
        - 0
        - {}
    name: conv2d_transpose_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_21
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_5
        - 0
        - 0
        - {}
    name: batch_normalization_21
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_21, trainable: true}
    inbound_nodes:
    - - - batch_normalization_21
        - 0
        - 0
        - {}
    name: leaky_re_lu_21
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_6
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_21
        - 0
        - 0
        - {}
    name: conv2d_transpose_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_22
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_6
        - 0
        - 0
        - {}
    name: batch_normalization_22
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_22, trainable: true}
    inbound_nodes:
    - - - batch_normalization_22
        - 0
        - 0
        - {}
    name: leaky_re_lu_22
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up_sampling2d_2
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_22
        - 0
        - 0
        - {}
    name: up_sampling2d_2
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_7
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - up_sampling2d_2
        - 0
        - 0
        - {}
    name: conv2d_transpose_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_23
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_7
        - 0
        - 0
        - {}
    name: batch_normalization_23
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_23, trainable: true}
    inbound_nodes:
    - - - batch_normalization_23
        - 0
        - 0
        - {}
    name: leaky_re_lu_23
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up_sampling2d_3
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_23
        - 0
        - 0
        - {}
    name: up_sampling2d_3
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_8
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - up_sampling2d_3
        - 0
        - 0
        - {}
    name: conv2d_transpose_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_24
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_8
        - 0
        - 0
        - {}
    name: batch_normalization_24
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_24, trainable: true}
    inbound_nodes:
    - - - batch_normalization_24
        - 0
        - 0
        - {}
    name: leaky_re_lu_24
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up_sampling2d_4
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_24
        - 0
        - 0
        - {}
    name: up_sampling2d_4
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id003
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: TruncatedNormal
        config: {mean: 0.0, seed: null, stddev: 0.1}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0005000000237487257}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_transpose_9
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - up_sampling2d_4
        - 0
        - 0
        - {}
    name: conv2d_transpose_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_25
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2d_transpose_9
        - 0
        - 0
        - {}
    name: batch_normalization_25
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_25, trainable: true}
    inbound_nodes:
    - - - batch_normalization_25
        - 0
        - 0
        - {}
    name: leaky_re_lu_25
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      interpolation: nearest
      name: up_sampling2d_5
      size: !!python/tuple [2, 2]
      trainable: true
